backend/Backend(Ci4)/app/Controllers/Auth.php

    public function processLogin() {
        $session = session();
        $model = new Tracker_UserModel();

        // Detect if request is JSON
        $isJson = $this->request->getHeaderLine('Content-Type') === 'application/json';

        if ($isJson) {
            $json = $this->request->getJSON();
            $email = $json->email ?? '';
            $password = $json->password ?? '';
        } else {
            // Handle form data (HTML form)
            $email = $this->request->getPost('email');
            $password = $this->request->getPost('password');
        }

        $user = $model->where('email', $email)->first();
---
SELECT *
FROM `Tracker_Users`
WHERE `email` = 'parth@gmail.com'
 LIMIT 1