backend/Backend(Ci4)/app/Models/YatraStopModel.php

SELECT *
FROM `yatra_stops`
ORDER BY `date` ASC
SELECT *
FROM `yatra_route_stops`
WHERE `yatra_stop_id` = '1'
---
    public function getStopsWithRoutes()
    {
        $builder = $this->db->table('yatra_stops');
        $builder->orderBy('date', 'ASC');
        $stops = $builder->get()->getResultArray();

        foreach ($stops as &$stop) {
            $routes = $this->db->table('yatra_route_stops')
                ->where('yatra_stop_id', $stop['id'])
                ->get()
                ->getResultArray();